
Процедура ОбновитьОтчеты(Параметры, АдресРезультата) Экспорт
	
	АктивныеДашборды = Параметры.АктивныеДашборды;
	ПараметрыОтчетов = Параметры.ПараметрыОтчетов;
	
	СформированныеДашборды = Новый Массив;
	
	Для каждого ВидДашборда Из АктивныеДашборды Цикл
		
		// В 1с серверные переменные не сохраняются между вызовами сервера и нельзя создавать классы, 
		// в которые можно было бы сохранить значение переменных,
		// b нельзя передавать объекты (мутабельные значения) в хранилище сеансовых данных 
		// поэтому создание объектов выполняем каждый раз.
		 
		// создание экземпляра
		Дашборд = Дашборды.Создать(ВидДашборда);
		
		Для Каждого Параметр Из ПараметрыОтчетов Цикл
			
			Если Дашборд.Параметры.Свойство(Параметр.Ключ) тогда
				Дашборд.Параметры[Параметр.Ключ] = Параметр.Значение;
			Иначе
				// такого параметра в дашборде нет, значит можно пропустить.
			КонецЕсли;
			
		КонецЦикла;
		
		// формирование отчета 
		Дашборды.СФормировать(Дашборд);
		
		СформированныеДашборды.Добавить(Дашборд);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СформированныеДашборды, АдресРезультата);
	
КонецПроцедуры

