
Функция ПараметрыHTTPЗапроса() Экспорт
	
	ПараметрыHTTPЗапроса = Новый Структура();
	ПараметрыHTTPЗапроса.Вставить("Сервер");
	ПараметрыHTTPЗапроса.Вставить("Адрес");
	ПараметрыHTTPЗапроса.Вставить("Метод");
	ПараметрыHTTPЗапроса.Вставить("КлиенсткийСертификат");

	Возврат ПараметрыHTTPЗапроса;
	
КонецФункции

Функция ПолучитьОтветHTTPЗапроса(ПараметрыЗапроса) Экспорт
	
	УРЛ = СтрШаблон("http://%1%2", ПараметрыЗапроса.Сервер, ПараметрыЗапроса.Адрес);
	
	Результат = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(УРЛ);
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(Результат.Путь);
	Возврат Текст.ПолучитьТекст();
	//Запрос = Новый HTTPЗапрос(ПараметрыЗапроса.Адрес);
	//Соединение = Новый HTTPСоединение(ПараметрыЗапроса.Сервер);
	//ОтветХТТП = Соединение.Получить(Запрос);
	// ОтветХТТП.ПолучитьТелоКакСтроку();

	
КонецФункции

Функция ПолучитьОтветHTTPЗапросаЗащищенный(ПараметрыЗапроса) Экспорт
	
	Запрос = Новый HTTPЗапрос(ПараметрыЗапроса.Адрес);
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(ПараметрыЗапроса.КлиенсткийСертификат, Новый СертификатыУдостоверяющихЦентровWindows());
	Соединение = Новый HTTPСоединение(ПараметрыЗапроса.Сервер,,,,,,ЗащищенноеСоединение);
	ОтветХТТП = Соединение.Получить(Запрос);
	
	Возврат ОтветХТТП.ПолучитьТелоКакСтроку(); 
	
КонецФункции

Функция ПрочитатьОтветHTTPЗапроса(ФайлДляЧтения) Экспорт
	
	#Если ВебКлиент Тогда
		
		ВызватьИсключение "Метод недопустимо вызывать с веб клиента!"
		
	#Иначе
		
		ЧтениеДанных = Новый ЧтениеJSON;
		ЧтениеДанных.УстановитьСтроку(ФайлДляЧтения);
		Результат = ПрочитатьJSON(ЧтениеДанных);
		ЧтениеДанных.Закрыть();
		
		Возврат Результат
	
	#КонецЕсли
	
КонецФункции 


