
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнаяВалюта = ОбщегоНазначенияУИПовтИсп.ПолучитьВалютуРегламентированногоУчета();

	Если Объект.Ссылка.Пустая() Тогда
		ПлатежнаяСистема = УправлениеНастройкамиПользователей.ПолучитьОсновнуюПлатежнуюСистему();
		Объект.ПлатежнаяСистемаИсточник = ПлатежнаяСистема;
		Объект.ПлатежнаяСистемаПриемник = ПлатежнаяСистема;
		Объект.ВалютаИсточник = ОсновнаяВалюта;
		Объект.ВалютаПриемник = ОсновнаяВалюта;
		Объект.ВидПеревода = "Основная";
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВалюты()
	
	Если Объект.ВидПеревода = "Основная" Тогда
		Объект.ВалютаИсточник = Объект.ВалютаПриемник;
		Объект.ВалютаПриемник = ОсновнаяВалюта;
	Иначе
		Объект.ВалютаПриемник = Объект.ВалютаИсточник;
		Объект.ВалютаИсточник = ОсновнаяВалюта;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	
	Если Объект.ВидПеревода = "Основная" Тогда
		Форма.Элементы.ВалютаПриемник.Доступность = Ложь;
		Форма.Элементы.ВалютаИсточник.Доступность = Истина;
	Иначе
		Форма.Элементы.ВалютаИсточник.Доступность = Ложь;
		Форма.Элементы.ВалютаПриемник.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//ДашбордыФормыКлиент.ОповеститьДашборды();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПереводаПриИзменении(Элемент)
	
	ИзменитьВалюты();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры
