
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПлатежнаяСистема =  УправлениеНастройкамиПользователей.ПолучитьОсновнуюПлатежнуюСистему();
		Объект.Валюта = УправлениеНастройкамиПользователей.ПолучитьОсновнуюВалюту();
		Объект.ИсточникСредств = УправлениеНастройкамиПользователей.ПолучитьОсновнойИсточникСредств();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//ДашбордыФормыКлиент.ОповеститьДашборды();
	ТекущиеСредстваФормыКлиент.ОповеститьИзменениеСредств();
	
КонецПроцедуры
