Функция ЗагрузитьКурсыТоварныхРынков() Экспорт
	
	ЗагружаемыеТовары = РаботаСКурсамиАльтернативныйВызовСервера.ПолучитьЗагружаемыеТовары();
		
	КонецПериода = ТекущаяДата();
	
	Для каждого СтрокаТовар Из ЗагружаемыеТовары Цикл
		
		НачалоПериода = СтрокаТовар.ДатаКурса;
		ПолучитьКурсыТоварныхРынков(НачалоПериода, КонецПериода, СтрокаТовар.Номенклатура);
		
	КонецЦикла;
		
КонецФункции

Функция ПолучитьКурсыТоварныхРынков(НачалоПериода, КонецПериода, Номенклатура)
	
	//Сейчас используем следующий сервис
	//https://www.quandl.com/blog/api-for-commodity-data
	//https://www.quandl.com/docs/api#data
	//https://www.quandl.com/api/v3/datasets/ODA/POILBRE_USD?start_date=2015-08-30&end_date=2015-09-30&collapse=weekly
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса();
	ПараметрыЗапроса.Метод = "GET";
	ПараметрыЗапроса.Сервер = "www.quandl.com";
	ПараметрыЗапроса.Адрес = "/api/v3/datasets/ODA/POILBRE_USD?start_date=2015-08-30&end_date=2015-09-30&collapse=weekly";
	

		
	#Если ВебКлиент Тогда
		ВызватьИсключение "Нужно дописать код. Не поддерживается выбор сертификата виндовс";
		
	#Иначе
		Запрос = Новый HTTPЗапрос(ПараметрыЗапроса.Адрес);
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Авто), Новый СертификатыУдостоверяющихЦентровWindows());
		Соединение = Новый HTTPСоединение(ПараметрыЗапроса.Сервер,,,,,,ЗащищенноеСоединение);
		ОтветХТТП = Соединение.Получить(Запрос);
	#КонецЕсли
	
КонецФункции

Функция ПараметрыHTTPЗапроса()
	
	ПараметрыHTTPЗапроса = Новый Структура();
	ПараметрыHTTPЗапроса.Вставить("Сервер");
	ПараметрыHTTPЗапроса.Вставить("Адрес");
	ПараметрыHTTPЗапроса.Вставить("Метод");
	
	Возврат ПараметрыHTTPЗапроса;
	
КонецФункции

Функция ПолучитьОтветHTTPЗапроса(ПараметрыЗапроса)
	
	Запрос = Новый HTTPЗапрос(ПараметрыЗапроса.Адрес);
	Соединение = Новый HTTPСоединение(ПараметрыЗапроса.Сервер);
	ОтветХТТП = Соединение.Получить(Запрос);
	
	Возврат ОтветХТТП.ПолучитьТелоКакСтроку();
	
КонецФункции

