#Область ПрограммныйИнтерфейс

Процедура Создать (Этот) Экспорт
	
	Этот.Результат  = Новый ТабличныйДокумент;
	ЗадатьНачальныеНастройки(Этот);
	
КонецПроцедуры

Процедура СФормировать(Этот) Экспорт
	
	Для каждого Параметр Из Этот.Параметры Цикл
		
		Если Не ЗначениеЗаполнено(Параметр.Значение) Тогда
			КодОшибки = 1;
			Дашборды.СообщитьОбОшибке(КодОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьДвижениеСредств(Этот);
	
КонецПроцедуры

Процедура РазместитьВИнтерфейсе(Форма, Этот) Экспорт
	
	Форма.ДвижениеСредствРезультат = Этот.Результат;
	
КонецПроцедуры

#КонецОбласти

Процедура СформироватьДвижениеСредств(Этот)
	
	Этот.Результат.Очистить();
	СхемаКомпоновки = Отчеты.ДвижениеСредств.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ОтчетыСКД.СформироватьОтчет(СхемаКомпоновки, Этот.Результат);
	
КонецПроцедуры

Процедура ЗадатьНачальныеНастройки(Этот)
	
	Этот.Результат.ФиксацияСлева = 0;
	
КонецПроцедуры
