
Функция ПоддерживаемыеСУБД() Экспорт
	
	ПоддерживаемыеСУБД = Новый Массив;
	ПоддерживаемыеСУБД.Добавить("MSSQLServer");
	
	Возврат ПоддерживаемыеСУБД;
	
КонецФункции

Процедура ПодключитьсяКБД(Параметры, АдресХранилища) Экспорт
	
	РеляционнаяБаза = ИнтерфейсSQLДрайвера.НативноеПодключениеБД(Параметры);
	
	СтатусПодключения = РеляционнаяБаза.ПолучитьСостояние();
	
	Если СтатусПодключения = СостояниеВнешнегоИсточникаДанных.Подключен Тогда
		СтатусПодключения = Перечисления.СтатусыПодключения.Подключен;
		КодСтатуса = "ПодключениеУстановлено";
	Иначе
		СтатусПодключения = Перечисления.СтатусыПодключения.Отключен;
		КодСтатуса = "ОшибкаПодключения";
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("СтатусПодключения", СтатусПодключения);
	Результат.Вставить("КодСтатуса", КодСтатуса);
	
	ПоместитьВоВременноеХранилище(СтатусПодключения, АдресХранилища);
	
КонецПроцедуры

Процедура ОбновлениеТаблицОтчета(Параметры, АдресХранилища) Экспорт
	
	СоединениеБД = ПараметрыСеанса.СоединениеБД;
	
	Результат = Новый Структура;
	Результат.Вставить("КодСтатуса", "");
	Результат.Вставить("Таблицы", Неопределено);
	
	Если ТипЗнч(СоединениеБД) = Тип("ХранилищеЗначения") Тогда
		
		РеляционнаяБаза = СоединениеБД.Получить();
		
		Если РеляционнаяБаза<>Неопределено Тогда
			
		Иначе
			КодСтатуса = "ОшибкаПодключения";
		КонецЕсли;
	Иначе
		КодСтатуса = "ОшибкаПодключения";
	КонецЕсли;
	
	
	
КонецПроцедуры

