#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	//ПервыйЗапускВызовСервера.ЗаполнитьНастройки();
	
	ПараметрыСеанса.ОсновнаяВалюта = ЗапросыВспомогательныеДанные.ПолучитьОсновнуюВалюту();
	ПараметрыСеанса.ДополнительнаяВалюта = Константы.ДополнительнаяВалюта.Получить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли