
&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	Если Параметры.Свойство("НаименованиеТовара") тогда
		
		Товар = Справочники.Номенклатура.НайтиПоНаименованию(Параметры.НаименованиеТовара);
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура", Товар);
		ОтчетыСКД.УстановитьПользовательскийПараметр(Отчет, "Номенклатура", Товар);
		
		ВалютаТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар, "Валюта");
		ОтчетыСКД.НазначитьОформлениеВалютыДиаграммы(Отчет.КомпоновщикНастроек.Настройки, ВалютаТовара, "Номенклатура.Валюта", "Номенклатура");
		
	КонецЕсли;
	
	Если Параметры.Свойство("НачалоПериода") Тогда
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", Параметры.НачалоПериода);
		ОтчетыСКД.УстановитьПользовательскийПараметр(Отчет, "НачалоПериода", Параметры.НачалоПериода);
	КонецЕсли;
	
	Если Параметры.Свойство("ОкончаниеПериода") Тогда
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериода", Параметры.ОкончаниеПериода);
		ОтчетыСКД.УстановитьПользовательскийПараметр(Отчет, "ОкончаниеПериода", Параметры.ОкончаниеПериода);
	КонецЕсли;
	
	Если Товар <> Неопределено Тогда
		Заголовок = Товар.Наименование;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СФормироватьОтчетНаСервере()
	
	НооменклатураПараметр = ОтчетыСКД.НайтиПользовательскийПараметр(Отчет.КомпоновщикНастроек, "Номенклатура");
	
	Если НооменклатураПараметр <> Неопределено Тогда
		ВалютаТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НооменклатураПараметр.Значение, "Валюта");
		ОтчетыСКД.НазначитьОформлениеВалютыДиаграммы(Отчет.КомпоновщикНастроек.Настройки, ВалютаТовара, "Номенклатура.Валюта", "Номенклатура");
	КонецЕсли;
	
	ЭтаФорма.СкомпоноватьРезультат();
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СФормироватьОтчетНаСервере()
	
КонецПроцедуры


