
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботыСФормамиУИ.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект);
	
	ТекущиеСредстваФормы.ЗаполнитьИнфоСредств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСредств" Тогда
		// Возникает в случае записи документов ввода, вывода средств.
		ЗаполнитьИнфоСредств();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнфоСредств()
	
	ТекущиеСредстваФормы.ЗаполнитьИнфоСредств(ЭтотОбъект);
	
КонецПроцедуры