
// Процедура - Обновить ввод средств
//
// Параметры:
//  СоздатьНовый - 	 - входящий.
//  РеквизитыДокумента - Структура - содержит параметры.
//   *Валюта
//   *Сумма
//   *ПлатежнаяСистема.
//  Ссылка		 - 	 - входящий / исходящий.
//  Дата		 - 	 - входящий / исходящий.
//
Функция ОбновитьВводСредств(знач РеквизитыДокумента) Экспорт
	
	// Обязательные реквизиты
	Ссылка = РеквизитыДокумента.Ссылка;
	Дата = РеквизитыДокумента.Дата;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВводСредств") Тогда
			ДокОбъект = Документы.ВводСредств.СоздатьДокумент();
			Ссылка = Документы.ВводСредств.ПолучитьСсылку();
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВыводСредств") Тогда
			ДокОбъект = Документы.ВыводСредств.СоздатьДокумент();
			Ссылка = Документы.ВыводСредств.ПолучитьСсылку();
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПереводМеждуЭПС") Тогда
			ДокОбъект = Документы.ПереводМеждуЭПС.СоздатьДокумент();
			Ссылка = Документы.ПереводМеждуЭПС.ПолучитьСсылку();
		КонецЕсли;
		ДокОбъект.УстановитьСсылкуНового(Ссылка);
	Иначе
		ДокОбъект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, РеквизитыДокумента);
	ДокОбъект.Дата = Дата;
	Если Не РеквизитыДокумента.Свойство("ПометкаУдаления") Тогда
		ДокОбъект.ПометкаУдаления = Ложь;
	КонецЕсли;
	
	Если ДокОбъект.ПометкаУдаления И ДокОбъект.Проведен Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	ИначеЕсли ДокОбъект.ПометкаУдаления И Не ДокОбъект.Проведен Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	СостояниеДокумента = ТекущиеСредстваФормы.КартинкаСостоянияДокумента(ДокОбъект.ПометкаУдаления);
	
	Возврат Новый Структура("Ссылка, Дата, СостояниеДокумента, ПометкаУдаления", Ссылка, Дата, СостояниеДокумента, Ложь);
	
КонецФункции

Процедура ОбновитьДокуметыДвиженияДенежныхСредств(знач ДобавляемыеДокументы) Экспорт
	
	Для каждого СтрокаДокумента Из ДобавляемыеДокументы Цикл
		ОбновитьВводСредств(СтрокаДокумента);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДокументыДенежныхСредств(знач УдаляемыеДокументы) Экспорт
	
	//УдалитьОбъекты(УдаляемыеДокументы, Ложь);
	
	Для каждого УдаляемыйДок Из УдаляемыеДокументы Цикл
		ПометитьНаУдалениеДок(УдаляемыйДок);
	КонецЦикла;
	
КонецПроцедуры

Функция ПометитьНаУдалениеДок(знач Ссылка) Экспорт
	
	УдаляемыйДокОб = Ссылка.ПолучитьОбъект();
	УдаляемыйДокОб.ПометкаУдаления = Истина;
	УдаляемыйДокОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
	СостояниеДокумента = ТекущиеСредстваФормы.КартинкаСостоянияДокумента(УдаляемыйДокОб.ПометкаУдаления);
	
	Возврат Новый Структура("СостояниеДокумента, ПометкаУдаления", СостояниеДокумента, УдаляемыйДокОб.ПометкаУдаления);
	
КонецФункции

Процедура УдалитьДокНепосредственно(знач Ссылка) Экспорт
	
	Доки = Новый Массив;
	Доки.Добавить(Ссылка);
	УдалитьОбъекты(Доки, Ложь);
	
КонецПроцедуры



