
&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	Если Параметры.Свойство("БуквенныйКодВалюты") Тогда
		Валюта = Справочники.Валюты.НайтиПоНаименованию(Параметры.БуквенныйКодВалюты);
		ОтчетыСКД.УстановитьПользовательскийПараметр(Отчет, "Валюта", Валюта);
		ОтчетыСКД.НазначитьОформлениеВалютыДиаграммы(Отчет.КомпоновщикНастроек.Настройки, Валюта, "Валюта");
	КонецЕсли;
	
	Если Параметры.Свойство("НачалоПериода") Тогда
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", Параметры.НачалоПериода);
		ОтчетыСКД.УстановитьПользовательскийПараметр(Отчет, "НачалоПериода", Параметры.НачалоПериода);
	КонецЕсли;
	
	Если Параметры.Свойство("ОкончаниеПериода") Тогда
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериода", Параметры.ОкончаниеПериода);
		ОтчетыСКД.УстановитьПользовательскийПараметр(Отчет, "ОкончаниеПериода", Параметры.ОкончаниеПериода);
	КонецЕсли;
	
	Если Валюта <> Неопределено Тогда
		Заголовок = Валюта.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СФормироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СФормироватьОтчетНаСервере()
	
	ВалютаПараметр = ОтчетыСКД.НайтиПользовательскийПараметр(Отчет.КомпоновщикНастроек, "Валюта");
	Если ВалютаПараметр <> Неопределено Тогда
		ОтчетыСКД.НазначитьОформлениеВалютыДиаграммы(Отчет.КомпоновщикНастроек.Настройки, ВалютаПараметр.Значение, "Валюта");
	КонецЕсли;
	
	ЭтаФорма.СкомпоноватьРезультат();
	
КонецПроцедуры



