Функция ВыполнитьВФоне(ИмяМетода, знач ПараметрыЗадания, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыЗадания, ПараметрыВыполненияВФоне);
	
КонецФункции

Функция ПроверитьЗаданиеВыполнено(ИдентификаторЗадания) Экспорт
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания)
	
КонецФункции

