
// Обратно преобразует массив структур в таблицу значений. Предполагается, что массив был получен 
// ранее из таблицы.
//
// Параметры:
//  МассивСоЗначениями - Массив -  массив строк таблице, в которой каждая строка является структурой.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - результат преобразования в таблицу.
//
Функция МассивВТаблицуЗначений(МассивСоЗначениями) Экспорт
	
	//Создаем таблцу значений
	Результат = Новый ТаблицаЗначений;
	
	Если МассивСоЗначениями.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
		
	Для каждого КлючИЗначениеСтруктуры Из МассивСоЗначениями[0] Цикл
		
		//Получаем имя ключа структуры
		//Получаем тип значения структуры
		ТипЗначенияКолонки = ТипЗнч(КлючИЗначениеСтруктуры.Значение);
		КоллекцияТипа = Новый ОписаниеТипов();
		КоллекцияТипа.Типы().Добавить(ТипЗначенияКолонки); 
		
		//Создаем колонку в таблице на  основании ключа и значения структуры
		Результат.Колонки.Добавить(КлючИЗначениеСтруктуры.Ключ, КоллекцияТипа); 
		
	КонецЦикла;
	
	Для Каждого СтрокаМассива Из МассивСоЗначениями Цикл
		
		//создаем новую строку таблицы
		СтрокаРезультата = Результат.Добавить();
		//заполняем строку таблицы значениями из массива
		ЗаполнитьЗначенияСвойств(СтрокаРезультата, СтрокаМассива);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Процедура помещает в применик значение, которые было запаковано в храниище.
//
// Параметры:
//  ЗначениеВХранилище - ХранилищеЗначения - вх, значение, которое требуется извлечь.
//  Приемник           - Любой - исх, в параметр передается извлеченное значение.
//
Процедура НазначитьЗначениеИзХранилища(ЗначениеВХранилище, Приемник) Экспорт
	
	Если ЗначениеВХранилище <> Неопределено Тогда
		ЗначениеИзХранилища = ЗначениеВХранилище.Получить();
		Приемник = ЗначениеИзХранилища;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВалютуРегламентированногоУчета() Экспорт
	
	Возврат ОбщегоНазначенияУИПовтИсп.ПолучитьВалютуРегламентированногоУчета();
КонецФункции

Функция ЦветRGB(Красный, Зеленый, Синий) Экспорт
	
	Возврат Новый Цвет(Красный, Зеленый, Синий);
	
КонецФункции

